{
  "title": "Graphql Explorer: Начните свое путешествие",
  "about": {
    "title": "О проекте",
    "content": [
      "Этот проект является неотъемлемой частью учебной программы RSSchool и предполагает создание комплексного приложения GraphiQL. Приложение может похвастаться приветственной страницей, которая приветствует пользователей, в сочетании с надежной системой аутентификации пользователей для обеспечения безопасного доступа.",
      "Главная страница GraphQL является сердцем приложения и обладает широким спектром функциональных возможностей. Пользователи могут воспользоваться редакторами запросов и переменных, редактором заголовков и обозревателем документации по запросу. Кроме того, имеется специальный раздел ответов и возможность с легкостью переключаться между различными конечными точками API.",
      "Техническая основа приложения построена на React 18+ и TypeScript. Оно придерживается строгих стандартов кодирования, которые включают семантический HTML, проверку на стороне клиента и минимальный охват тестированием в 80%. Эти меры гарантируют высококачественную кодовую базу и надежное приложение.",
      "Дизайн приложения отдает приоритет интерактивности, предлагая адаптивный макет, обеспечивающий согласованность на различных устройствах и платформах. Конечный продукт предоставляет удобный интерфейс GraphiQL, поддерживающий несколько языков, что значительно улучшает пользовательский опыт для тех, кто взаимодействует с API GraphQL."
    ]
  },
  "team": {
    "title": "Наша команда",
    "members": {
      "semyon": {
        "name": "Семен Калашников",
        "position": "Лидер команды",
        "description": "Как руководитель группы, этот участник сыграл ключевую роль в налаживании командного сотрудничества и создании хранилища проектов. Они отвечали за визуальный аспект интерфейса и написали тесты для различных компонентов, обеспечивая как эстетическую привлекательность, так и функциональную надежность проекта."
      },
      "dimash": {
        "name": "Динмухамед Амиров",
        "position": "Frontend разработчик",
        "description": "Этот специалист сыграл важную роль в настройке основных аспектов GraphiQL playground и переводе приложения. Их усилия позволили создать более интуитивно понятный и доступный интерфейс, ориентированный на более широкую аудиторию и улучшающий взаимодействие с пользователем."
      },
      "almas": {
        "name": "Алмас Киличов",
        "position": "Frontend разработчик",
        "description": "Специализируясь на Firebase, этот участник сыграл решающую роль в разработке процесса регистрации и перенаправлений. Они также внесли значительный вклад в отображение документации в GraphiQL, улучшив общую функциональность и удобство работы с проектом для пользователей."
      }
    }
  },
  "rss": {
    "title": "Школьный курс",
    "content": [
      "Курс React, предлагаемый школой Rolling Scopes (RSSchool), является бесплатной онлайн-программой. Он специально разработан для студентов, успешно окончивших RS School Stage #2, или для тех, кто имеет практический опыт работы с JavaScript, TypeScript, Git, GitHub, NPM, Webpack, CSS3/HTML5 и глубокое понимание REST.",
      "Курс является инклюзивным, предоставляя возможность лицам любого профессионального уровня образование или местоположение для изучения и совершенствования своих навыков. Он служит платформой для личностного и профессионального роста в области веб-разработки.",
      "По окончании слушателям выдается электронный сертификат, подтверждающий их преданность делу и приобретенные навыки. Начало курса запланировано на 23 октября 2023 года. Это воплощает школьный принцип 'Плати вперед', который поощряет участников вносить вклад в сообщество, делясь своими знаниями и становясь наставниками для следующего поколения учащихся. Для получения дополнительной информации или для регистрации заинтересованным лицам предлагается посетить веб-сайт"
    ]
  },
  "header": {
    "graphQL": "Переходите на Graphql!",
    "language": {
      "russian": "Русский",
      "english": "Английский"
    },
    "sign": {
      "in": "Войти",
      "up": "Регистрация"
    }
  },
  "signIn": {
    "title": "Войти",
    "email": "Введите свой адрес электронной почты",
    "password": "Введите свой пароль",
    "submit": "Отправить",
    "hint": "Если вы здесь новенький и у вас еще нет учетной записи, пожалуйста, нажмите здесь для",
    "link": "регистрации"

  },
  "signUp": {
    "title": "Регистрация",
    "email": "Введите адрес электронной почты",
    "password": "Введите пароль",
    "confirm": "Повторите  пароль",
    "submit": "Отправить",
    "hint": "Если у вас уже есть учетная запись, пожалуйста, нажмите здесь, чтобы",
    "link": "войти"
  },
  "graphQL": {
    "title": "Страница GraphiQL",
    "docs": "Доки"
  }
}
